Repository: blackburn2601/dropcrypt
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de

source: Please enter a message.
de: Bitte geben Sie eine Nachricht ein.

source: This message is no longer available.
de: Diese Nachricht ist nicht länger verfügbar.

source: This message has expired or was already accessed.
de: Diese Nachricht ist leider abgelaufen oder wurde bereits gelesen.

source: Invalid token.
de: Ungültiger Token

source: Decryption failed.
de: Entschlüsselung fehlgeschlagen.

source: Page not found
de: Seite nicht gefunden

source: The page you are looking for does not exist.
de: Die Seite die Sie suchen existiert leider nicht.

source: Go to homepage
de: Zur Startseite

source: About DropCrypt
de: Über DropCrypt

source: DropCrypt allows you to send secure, encrypted one-time messages.
de: DropCrypt ermöglicht es dir, sichere, verschlüsselte Einmal-Nachrichten zu versenden.

source: No accounts, no tracking, no nonsense.
de: Keine Konto notwendig, keine Verfolgung, kein Blödsinn.

source: Contact
de: Kontakt

source: For feedback or questions, contact us at:
de: Für Feedback oder Fragen, schreib uns an:

source: Support DropCrypt
de: Unterstütze DropCrypt

source: If you appreciate this service, consider supporting the project:
de: Wenn dir dieser Service gefällt, unterstütze das Projekt:

source: Thank you for your support!
de: Vielen Dank für deine Unterstützung!

source: Create a secure drop
de: Sichere Nachricht erstellen

source: Enter your sensitive information here...
de: Gib hier deine vertrauliche Nachricht ein...

source: Create Link
de: Link erstellen

source: Your secure link:
de: Dein sicherer Link:

source: About
de: Über

source: Privacy
de: Datenschutz

source: Donate
de: Spenden

source: Privacy Policy
de: Datenschutzerklärung

source: We respect your privacy. DropCrypt stores no metadata and deletes all messages automatically.
de: Wir respektieren deine Privatsphäre. DropCrypt speichert keine Metadaten und löscht alle Nachrichten automatisch.

source: End-to-end encryption by default.
de: Standardmäßig Ende-zu-Ende-Verschlüsselung.

source: Self-destruction after access or timeout.
de: Selbstzerstörung nach Zugriff oder Zeitablauf.

source: No logs, no IPs, no tracking.
de: Keine Logs, keine IPs, kein Tracking.

source: Encrypted Message
de: Verschlüsselte Nachricht

source: The message was successfully decrypted:
de: Die Nachricht wurde erfolgreich entschlüsselt:

source: This message has now been deleted.
de: Diese Nachricht wurde jetzt gelöscht.

source: Toggle theme
de: Design umschalten

source: Toggle dark mode
de: Dunkelmodus umschalten

source: Copy link
de: Link kopieren

source: Link copied!
de: Link kopiert!

source: Share this link securely:
de: Teile diesen Link sicher:

source: This link can only be accessed once and expires in 60 minutes.
de: Dieser Link kann nur einmal aufgerufen werden und läuft in 60 Minuten ab.

source: Generate secure link
de: Sicheren Link generieren

source: Enter your secret message here...
de: Gib hier deine geheime Nachricht ein...

source: Secure One-Time Message Sharing
de: Sichere Einmal-Nachrichtenübermittlung

source: Share encrypted messages that can only be viewed once
de: Teile verschlüsselte Nachrichten, die nur einmal angesehen werden können

source: Legal Notice
de: Impressum

source: Terms of Service
de: Nutzungsbedingungen

source: Donation Notice
de: Spendenhinweis

source: Enter Message
de: Nachricht eingeben

source: Generate Link
de: Link generieren

source: Share Link
de: Link<br>teilen

source: Auto-delete
de: Automatisch löschen

source: Encrypting message...
de: Nachricht wird verschlüsselt...

source: Decrypting message...
de: Nachricht wird entschlüsselt...

source: Copy to clipboard
de: In die Zwischenablage kopieren

source: Copied!
de: Kopiert!

source: 404 - Page not found
de: 404 - Seite nicht gefunden

source: Write message
de: Nachricht schreiben

source: Get secure link
de: Sicheren Link erhalten

source: Share link
de: Link<br>teilen

source: Encrypting your message...
de: Deine Nachricht wird verschlüsselt...

source: Generate Secure Link
de: Sicheren Link generieren

source: How does it work in detail?
de: Wie funktioniert es im Detail?

source: 1. Message Encryption
de: 1. Nachrichtenverschlüsselung

source: Your message is encrypted using AES-GCM with a unique key derived from a random token. This token is part of the generated link and is never stored on our servers - only used to create the encryption key.
de: Deine Nachricht wird mit AES-GCM und einem einzigartigen Schlüssel verschlüsselt, der aus einem zufälligen Token generiert wird. Dieser Token ist Teil des generierten Links und wird nie auf unseren Servern gespeichert - er wird nur zur Erstellung des Verschlüsselungsschlüssels verwendet.

source: 2. Secure Storage
de: 2. Sichere Speicherung

source: We only store two things: Your encrypted message and a hash of the access token (not the token itself). This means even we cannot decrypt your message without the complete link.
de: Wir speichern nur zwei Dinge: Deine verschlüsselte Nachricht und einen Hash des Zugriffstokens (nicht den Token selbst). Das bedeutet, dass selbst wir deine Nachricht ohne den vollständigen Link nicht entschlüsseln können.

source: 3. One-Time Access
de: 3. Einmaliger Zugriff

source: When someone opens the link, the token in the URL is used to recreate the encryption key. After successful decryption, both the encrypted message and token hash are immediately deleted.
de: Wenn jemand den Link öffnet, wird der Token in der URL verwendet, um den Verschlüsselungsschlüssel neu zu erstellen. Nach erfolgreicher Entschlüsselung werden sowohl die verschlüsselte Nachricht als auch der Token-Hash sofort gelöscht.

source: 4. Automatic Expiration
de: 4. Automatischer Ablauf

source: If a message is not accessed within 60 minutes, it is automatically deleted from our servers. This ensures that no data remains stored longer than necessary.
de: Wenn eine Nachricht nicht innerhalb von 60 Minuten abgerufen wird, wird sie automatisch von unseren Servern gelöscht. Dies stellt sicher, dass keine Daten länger als nötig gespeichert bleiben.

source: We use cookies to enhance your experience. By continuing to visit this site you agree to our use of cookies.
de: Wir verwenden Cookies, um Ihre Erfahrung zu verbessern. Durch die weitere Nutzung dieser Website stimmen Sie der Verwendung von Cookies zu.

source: Accept All
de: Alle akzeptieren

source: Cookie Settings
de: Cookie-Einstellungen

source: Necessary (Required)
de: Notwendig (Erforderlich)

source: Analytics
de: Analyse

source: Save Settings
de: Einstellungen speichern
